In [1]:
import pandas as pd
customer_df = pd.read_csv("../Resources/customers.csv")
customer_df.head()

          FullName                     Email  ...           CreditCard  Balance
0  Altha Frederick  unhideable1966@gmail.com  ...  2524 2317 2139 4751    21511
1  Nickolas Harvey   allgood1803@outlook.com  ...  4756 0997 9568 1329    13850
2  Jesusita Kinney    satsumas1954@yahoo.com  ...    3717 863466 48574    21254
3      Mose Gordon    antifowl1875@gmail.com  ...  5413 1700 6989 2835     5221
4  Cesar Valentine  acetaminol1979@yahoo.com  ...  5173 4883 9215 4743     8300

[5 rows x 6 columns]

In [2]:
customer_df.columns

Index(['FullName', 'Email', 'Address', 'Zip', 'CreditCard', 'Balance'], dtype='object')

In [4]:
customer_df = customer_df.rename(columns={
    "CreditCard":"credit_card",
    "FullName":"full_name"
})

customer_df.head()

         full_name                     Email  ...          credit_card  Balance
0  Altha Frederick  unhideable1966@gmail.com  ...  2524 2317 2139 4751    21511
1  Nickolas Harvey   allgood1803@outlook.com  ...  4756 0997 9568 1329    13850
2  Jesusita Kinney    satsumas1954@yahoo.com  ...    3717 863466 48574    21254
3      Mose Gordon    antifowl1875@gmail.com  ...  5413 1700 6989 2835     5221
4  Cesar Valentine  acetaminol1979@yahoo.com  ...  5173 4883 9215 4743     8300

[5 rows x 6 columns]

In [5]:
customer_df["Email"]

0     unhideable1966@gmail.com
1      allgood1803@outlook.com
2       satsumas1954@yahoo.com
3       antifowl1875@gmail.com
4     acetaminol1979@yahoo.com
                ...
95       plantula1818@live.com
96    doolittle1818@yandex.com
97          mosso1961@live.com
98      ovenful1914@yandex.com
99        esson1909@yandex.com
Name: Email, Length: 100, dtype: object

In [7]:
customer_df[["Email","full_name", "Zip"]]

                       Email          full_name    Zip
0   unhideable1966@gmail.com    Altha Frederick  31353
1    allgood1803@outlook.com    Nickolas Harvey   1922
2     satsumas1954@yahoo.com    Jesusita Kinney  41535
3     antifowl1875@gmail.com        Mose Gordon  16098
4   acetaminol1979@yahoo.com    Cesar Valentine  99895
..                       ...                ...    ...
95     plantula1818@live.com     Crystle Larson  74413
96  doolittle1818@yandex.com    Jetta Davenport  73152
97        mosso1961@live.com    Dallas Johnston  88215
98    ovenful1914@yandex.com  Roberto Daugherty  33903
99      esson1909@yandex.com       Abel Walters  39186

[100 rows x 3 columns]

In [9]:
customer_df["Balance"] / 1000

0     21.511
1     13.850
2     21.254
3      5.221
4      8.300
       ...
95     5.091
96    16.509
97    24.196
98    18.828
99     3.400
Name: Balance, Length: 100, dtype: float64

In [11]:
customer_df["Balance_1K"] = customer_df["Balance"] / 1000
customer_df.head()

         full_name                     Email  ... Balance  Balance_1K
0  Altha Frederick  unhideable1966@gmail.com  ...   21511      21.511
1  Nickolas Harvey   allgood1803@outlook.com  ...   13850      13.850
2  Jesusita Kinney    satsumas1954@yahoo.com  ...   21254      21.254
3      Mose Gordon    antifowl1875@gmail.com  ...    5221       5.221
4  Cesar Valentine  acetaminol1979@yahoo.com  ...    8300       8.300

[5 rows x 7 columns]

In [14]:
names = customer_df["full_name"].str.split(" ", expand=True)
customer_df["fname"] = names[0]
customer_df["lname"] = names[1]
customer_df.head()

         full_name                     Email  ...     fname      lname
0  Altha Frederick  unhideable1966@gmail.com  ...     Altha  Frederick
1  Nickolas Harvey   allgood1803@outlook.com  ...  Nickolas     Harvey
2  Jesusita Kinney    satsumas1954@yahoo.com  ...  Jesusita     Kinney
3      Mose Gordon    antifowl1875@gmail.com  ...      Mose     Gordon
4  Cesar Valentine  acetaminol1979@yahoo.com  ...     Cesar  Valentine

[5 rows x 9 columns]

In [16]:
customer_df.drop(columns=["full_name"], inplace=True)
customer_df.head()

                      Email                  Address  ...     fname      lname
0  unhideable1966@gmail.com  67 John Maher Extension  ...     Altha  Frederick
1   allgood1803@outlook.com        1200 Madera Plaza  ...  Nickolas     Harvey
2    satsumas1954@yahoo.com         943 Gibb Highway  ...  Jesusita     Kinney
3    antifowl1875@gmail.com          1073 Fell Trace  ...      Mose     Gordon
4  acetaminol1979@yahoo.com   805 Marshall Promenade  ...     Cesar  Valentine

[5 rows x 8 columns]